# Создать список, состоящий из кубов нечётных чисел от 1 до 1000 (куб X - третья степень числа X):
# Вычислить сумму тех чисел из этого списка, сумма цифр которых делится нацело на 7.
# Например, число «19 ^ 3 = 6859» будем включать в сумму, так как 6 + 8 + 5 + 9 = 28 – делится нацело на 7.
# Внимание: использовать только арифметические операции!
# К каждому элементу списка добавить 17 и заново вычислить сумму тех чисел из этого списка,
# сумма цифр которых делится нацело на 7.
# * Решить задачу под пунктом b, не создавая новый список.


items = []
for i in range (1,1000,2):
    items.append(i**3)

# print(items)

result = []

for i in range (len(items)):
    temp = str(items[i])
    sum_temp = 0
    for j in temp:
        sum_temp += int(j)
    if sum_temp % 7 == 0:
        result.append(sum_temp)

print(temp)
#print(result)

# не понял как делать
