# Реализовать склонение слова «процент» во фразе «N процентов».
# Вывести эту фразу на экран отдельной строкой для каждого из чисел в интервале от 1 до 100:
# 1 процент
# 2 процента
# 3 процента
# 4 процента
# 5 процентов
# 6 процентов
# ...
# 100 процентов

for numbers in range (1, 101):
    if numbers % 10 == 1 and numbers % 100 != 11:
        x = ''
    elif numbers % 10 in [2, 3, 4] and numbers % 100 not in [12, 13, 14]:
        x = 'а'
    elif numbers % 10 in [0, 5, 6, 7, 8, 9] and numbers % 100 not in [12, 13, 14]:
        x = 'ов'
    print(numbers, 'процент'+x)